Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_SNVS.h
#define SNVS_LPTGF2CR_ETGF10_MASK                (0x7F000000U)
#define SNVS_LPTGF2CR_ETGF10_SHIFT               (24U)
#define SNVS_LPTGF2CR_ETGF10(x)                  (((uint32_t)(((uint32_t)(x)) << SNVS_LPTGF2CR_ETGF10_SHIFT)) & SNVS_LPTGF2CR_ETGF10_MASK)

#define SNVS_LPTGF2CR_ETGF10_EN_MASK             (0x80000000U)
#define SNVS_LPTGF2CR_ETGF10_EN_SHIFT            (31U)
/*! ETGF10_EN
 *  0b0..External tamper glitch filter 10 is bypassed.
 *  0b1..External tamper glitch filter 10 is enabled.
 */
#define SNVS_LPTGF2CR_ETGF10_EN(x)               (((uint32_t)(((uint32_t)(x)) << SNVS_LPTGF2CR_ETGF10_EN_SHIFT)) & SNVS_LPTGF2CR_ETGF10_EN_MASK)
/*! @} */

/*! @name LPATCR - SNVS_LP Active Tamper 1 Configuration Register..SNVS_LP Active Tamper 5 Configuration Register */
/*! @{ */

#define SNVS_LPATCR_Seed_MASK                    (0xFFFFU)
#define SNVS_LPATCR_Seed_SHIFT                   (0U)
#define SNVS_LPATCR_Seed(x)                      (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCR_Seed_SHIFT)) & SNVS_LPATCR_Seed_MASK)

#define SNVS_LPATCR_Polynomial_MASK              (0xFFFF0000U)
#define SNVS_LPATCR_Polynomial_SHIFT             (16U)
#define SNVS_LPATCR_Polynomial(x)                (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCR_Polynomial_SHIFT)) & SNVS_LPATCR_Polynomial_MASK)
/*! @} */

/*! @name LPATCTLR - SNVS_LP Active Tamper Control Register */
/*! @{ */

#define SNVS_LPATCTLR_AT1_EN_MASK                (0x1U)
#define SNVS_LPATCTLR_AT1_EN_SHIFT               (0U)
/*! AT1_EN
 *  0b0..Active Tamper 1 is disabled.
 *  0b1..Active Tamper 1 is enabled.
 */
#define SNVS_LPATCTLR_AT1_EN(x)                  (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT1_EN_SHIFT)) & SNVS_LPATCTLR_AT1_EN_MASK)

#define SNVS_LPATCTLR_AT2_EN_MASK                (0x2U)
#define SNVS_LPATCTLR_AT2_EN_SHIFT               (1U)
/*! AT2_EN
 *  0b0..Active Tamper 2 is disabled.
 *  0b1..Active Tamper 2 is enabled.
 */
#define SNVS_LPATCTLR_AT2_EN(x)                  (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT2_EN_SHIFT)) & SNVS_LPATCTLR_AT2_EN_MASK)

#define SNVS_LPATCTLR_AT3_EN_MASK                (0x4U)
#define SNVS_LPATCTLR_AT3_EN_SHIFT               (2U)
/*! AT3_EN
 *  0b0..Active Tamper 3 is disabled.
 *  0b1..Active Tamper 3 is enabled.
 */
#define SNVS_LPATCTLR_AT3_EN(x)                  (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT3_EN_SHIFT)) & SNVS_LPATCTLR_AT3_EN_MASK)

#define SNVS_LPATCTLR_AT4_EN_MASK                (0x8U)
#define SNVS_LPATCTLR_AT4_EN_SHIFT               (3U)
/*! AT4_EN
 *  0b0..Active Tamper 4 is disabled.
 *  0b1..Active Tamper 4 is enabled.
 */
#define SNVS_LPATCTLR_AT4_EN(x)                  (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT4_EN_SHIFT)) & SNVS_LPATCTLR_AT4_EN_MASK)

#define SNVS_LPATCTLR_AT5_EN_MASK                (0x10U)
#define SNVS_LPATCTLR_AT5_EN_SHIFT               (4U)
/*! AT5_EN
 *  0b0..Active Tamper 5 is disabled.
 *  0b1..Active Tamper 5 is enabled.
 */
#define SNVS_LPATCTLR_AT5_EN(x)                  (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT5_EN_SHIFT)) & SNVS_LPATCTLR_AT5_EN_MASK)

#define SNVS_LPATCTLR_AT1_PAD_EN_MASK            (0x10000U)
#define SNVS_LPATCTLR_AT1_PAD_EN_SHIFT           (16U)
/*! AT1_PAD_EN
 *  0b0..Active Tamper 1 is disabled.
 *  0b1..Active Tamper 1 is enabled.
 */
#define SNVS_LPATCTLR_AT1_PAD_EN(x)              (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT1_PAD_EN_SHIFT)) & SNVS_LPATCTLR_AT1_PAD_EN_MASK)

#define SNVS_LPATCTLR_AT2_PAD_EN_MASK            (0x20000U)
#define SNVS_LPATCTLR_AT2_PAD_EN_SHIFT           (17U)
/*! AT2_PAD_EN
 *  0b0..Active Tamper 2 is disabled.
 *  0b1..Active Tamper 2 is enabled.
 */
#define SNVS_LPATCTLR_AT2_PAD_EN(x)              (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT2_PAD_EN_SHIFT)) & SNVS_LPATCTLR_AT2_PAD_EN_MASK)

#define SNVS_LPATCTLR_AT3_PAD_EN_MASK            (0x40000U)
#define SNVS_LPATCTLR_AT3_PAD_EN_SHIFT           (18U)
/*! AT3_PAD_EN
 *  0b0..Active Tamper 3 is disabled.
 *  0b1..Active Tamper 3 is enabled
 */
#define SNVS_LPATCTLR_AT3_PAD_EN(x)              (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT3_PAD_EN_SHIFT)) & SNVS_LPATCTLR_AT3_PAD_EN_MASK)

#define SNVS_LPATCTLR_AT4_PAD_EN_MASK            (0x80000U)
#define SNVS_LPATCTLR_AT4_PAD_EN_SHIFT           (19U)
/*! AT4_PAD_EN
 *  0b0..Active Tamper 4 is disabled.
 *  0b1..Active Tamper 4 is enabled.
 */
#define SNVS_LPATCTLR_AT4_PAD_EN(x)              (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT4_PAD_EN_SHIFT)) & SNVS_LPATCTLR_AT4_PAD_EN_MASK)

#define SNVS_LPATCTLR_AT5_PAD_EN_MASK            (0x100000U)
#define SNVS_LPATCTLR_AT5_PAD_EN_SHIFT           (20U)
/*! AT5_PAD_EN
 *  0b0..Active Tamper 5 is disabled.
 *  0b1..Active Tamper 5 is enabled.
 */
#define SNVS_LPATCTLR_AT5_PAD_EN(x)              (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCTLR_AT5_PAD_EN_SHIFT)) & SNVS_LPATCTLR_AT5_PAD_EN_MASK)
/*! @} */

/*! @name LPATCLKR - SNVS_LP Active Tamper Clock Control Register */
/*! @{ */

#define SNVS_LPATCLKR_AT1_CLK_CTL_MASK           (0x3U)
#define SNVS_LPATCLKR_AT1_CLK_CTL_SHIFT          (0U)
#define SNVS_LPATCLKR_AT1_CLK_CTL(x)             (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCLKR_AT1_CLK_CTL_SHIFT)) & SNVS_LPATCLKR_AT1_CLK_CTL_MASK)

#define SNVS_LPATCLKR_AT2_CLK_CTL_MASK           (0x30U)
#define SNVS_LPATCLKR_AT2_CLK_CTL_SHIFT          (4U)
#define SNVS_LPATCLKR_AT2_CLK_CTL(x)             (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCLKR_AT2_CLK_CTL_SHIFT)) & SNVS_LPATCLKR_AT2_CLK_CTL_MASK)

#define SNVS_LPATCLKR_AT3_CLK_CTL_MASK           (0x300U)
#define SNVS_LPATCLKR_AT3_CLK_CTL_SHIFT          (8U)
#define SNVS_LPATCLKR_AT3_CLK_CTL(x)             (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCLKR_AT3_CLK_CTL_SHIFT)) & SNVS_LPATCLKR_AT3_CLK_CTL_MASK)

#define SNVS_LPATCLKR_AT4_CLK_CTL_MASK           (0x3000U)
#define SNVS_LPATCLKR_AT4_CLK_CTL_SHIFT          (12U)
#define SNVS_LPATCLKR_AT4_CLK_CTL(x)             (((uint32_t)(((uint32_t)(x)) << SNVS_LPATCLKR_AT4_CLK_CTL_SHIFT)) & SNVS_LPATCLKR_AT4_CLK_CTL_MASK)

